if __name__ == '__main__':
    data = [{"id": "125644", "title": "第一节 磁现象\r"},
            {"id": "125645", "title": "第二节 电生磁\r"},
            {"id": "125646", "title": "第三节 电磁铁\r"},
            {"id": "125647", "title": "第四节 电动机\r"},
            {"id": "125648", "title": "第五节 磁生电\r"},
            {"id": "125649", "title": "第六节 发电机\r"},
            {"id": "125651", "title": "第一节 电话\r"},
            {"id": "125652", "title": "第二节 电磁波的产生与传播\r"},
            {"id": "125653", "title": "第三节 无线电通信\r"},
            {"id": "125654", "title": "第四节 现代通信\r"},
            {"id": "125656", "title": "第一节 温度\r"},
            {"id": "125657", "title": "第二节 熔化和凝固\r"},
            {"id": "125658", "title": "第三节 汽化和液化\r"},
            {"id": "125659", "title": "第四节 升华和凝华\r"},
            {"id": "125663", "title": "第一节 物质的分子构成\r"},
            {"id": "125664", "title": "第二节 分子热运动\r"},
            {"id": "125665", "title": "第三节 内能及其改变\r"},
            {"id": "125666", "title": "第四节 比热容\r"},
            {"id": "125667", "title": "第五节 热机\r"},
            {"id": "125668", "title": "第六节 能量的转化和守恒\r"},
            {"id": "125671", "title": "第一节 能源\r"},
            {"id": "125672", "title": "第二节 核能\r"},
            {"id": "125673", "title": "第三节 太阳能\r"},
            {"id": "125674", "title": "第四节 能源革命\r"},
            {"id": "125675", "title": "第五节 能源与环境\r"}]
    for d in data:
        print(
            "INSERT INTO chapter (`chapter_id`, `chapter_name`, `unit_id`, `book_id`) VALUES ('%s', '%s', NULL, '35566');" % (
                d.get('id'), d.get('title').strip()))
