if __name__ == '__main__':
    data = [{"id": "5443", "title": "第一节  植物的生殖"},
            {"id": "5444", "title": "第二节 昆虫的生殖和发育"},
            {"id": "5445", "title": "第三节 两栖动物的生殖和发育"},
            {"id": "5446", "title": "第四节 鸟的生殖和发育"},
            {"id": "5448", "title": "第一节 基因控制生物的性状"},
            {"id": "5449", "title": "第二节  基因在亲子代间的传递"},
            {"id": "5450", "title": "第三节  基因的显性和隐性"},
            {"id": "5451", "title": "第四节 人的性别遗传"},
            {"id": "5452", "title": "第五节 生物的变异"},
            {"id": "5454", "title": "第一节 地球上生命的起源"},
            {"id": "5455", "title": "第二节 生物进化的历程"},
            {"id": "5456", "title": "第三节 生物进化的原因"},
            {"id": "11799", "title": "第一节 传染病及其预防"},
            {"id": "5459", "title": "第二节 免疫与计划免疫"},
            {"id": "5460", "title": "第一节 用药和急救"},
            {"id": "5462", "title": "第一节 评价自己的健康状况"},
            {"id": "5463", "title": "第二节 选择健康的生活方式"}
            ]
    for d in data:
        print(
            "INSERT INTO chapter (`chapter_id`, `chapter_name`, `unit_id`, `book_id`) VALUES ('%s', '%s', NULL, '4587');" % (
                d.get('id'), d.get('title')))
